<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Postman.</string>
    <key>Identifier</key>
    <string>com.github.bnpl.autopkg.download.postman</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_URL</key>
        <string>https://dl.pstmn.io/download/latest/osx</string>
        <key>NAME</key>
        <string>Postman</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
  	<array>
  		<dict>
  			<key>Arguments</key>
  			<dict>
  				<key>filename</key>
  				<string>%NAME%.zip</string>
  				<key>url</key>
  				<string>%DOWNLOAD_URL%</string>
  			</dict>
  			<key>Processor</key>
  			<string>URLDownloader</string>
  		</dict>
  		<dict>
  			<key>Processor</key>
  			<string>EndOfCheckPhase</string>
  		</dict>
      <dict>
          <key>Processor</key>
          <string>Unarchiver</string>
          <key>Arguments</key>
          <dict>
              <key>archive_path</key>
              <string>%pathname%</string>
              <key>destination_path</key>
              <string>%RECIPE_CACHE_DIR%/%NAME%</string>
              <key>purge_destination</key>
              <true/>
          </dict>
      </dict>
      <dict>
          <key>Processor</key>
          <string>CodeSignatureVerifier</string>
          <key>Arguments</key>
          <dict>
              <key>input_path</key>
              <string>%RECIPE_CACHE_DIR%/%NAME%/Postman.app</string>
              <key>requirement</key>
              <string>identifier "com.postmanlabs.mac" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = H7H8Q7M5CK</string>
          </dict>
      </dict>
  	</array>
  </dict>
  </plist>
