<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Voltera software and imports it to Munki.</string>
    <key>Identifier</key>
    <string>com.github.bnpl.autopkg.munki.voltera</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Voltera</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Hardware</string>
            <key>description</key>
            <string>Build hardware faster.  Prototype on your desktop with the Voltera V-One PCB Printer.</string>
            <key>developer</key>
            <string>Voltera Inc.</string>
            <key>display_name</key>
            <string>Voltera</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
            <key>uninstallable</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.3</string>
    <key>ParentRecipe</key>
    <string>com.github.bnpl.autopkg.download.voltera</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>