<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release of an application from Microsoft App Center. This recipe should only ever be used through its child recipe with specific values overridden (OWNER_NAME, APP_NAME, X_API_TOKEN, CSV_REQ, NAME).</string>
    <key>Identifier</key>
    <string>com.github.bnpl.autopkg.download.appcenterapp</string>
    <key>Input</key>
    <dict>
        <key>OWNER_NAME</key>
        <string>owner_name</string>
        <key>APP_NAME</key>
        <string>app_name</string>
        <key>X_API_TOKEN</key>
        <string>x_api_token</string>

        <key>CSV_REQ</key>
        <string>none</string>
        <key>NAME</key>
        <string>AppCenterApp</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://api.appcenter.ms/v0.1/apps/%OWNER_NAME%/%APP_NAME%/releases/latest</string>
                <key>re_pattern</key>
                <string>"download_url":"(.*)","install_url"</string>
                <key>result_output_var_name</key>
                <string>DOWNLOAD_URL</string>
                <key>request_headers</key>
                <dict>
                    <key>Accept</key>
                    <string>application/json</string>
                    <key>X-API-Token</key>
                    <string>%X_API_TOKEN%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
                <key>requirement</key>
                <string>%CSV_REQ%</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
	</dict>
	<dict>
	    <key>Arguments</key>
	    <dict>
		<key>input_plist_path</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app/Contents/Info.plist</string>
		<key>plist_version_key</key>
		<string>CFBundleShortVersionString</string>
	    </dict>
	    <key>Processor</key>
	    <string>Versioner</string>
	</dict>
    </array>
</dict>
</plist>
