<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of SQuirreL SQL Client and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.bnpl.autopkg.pkg.squirrelsql</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SQuirreLSQL</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.8</string>
    <key>ParentRecipe</key>
    <string>com.github.bnpl.autopkg.download.squirrelsql</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.bnpl.autopkg.proc.IzPackExecutor/IzPackExecutor</string>
            <key>Arguments</key>
            <dict>
                <key>app_root</key>
                <string>%pkgroot%/Applications/SquirreL SQL.app</string>
                <key>app_installer</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PlistEditor</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%app_root%/Contents/Info.plist</string>
                <key>output_plist_path</key>
                <string>%app_root%/Contents/Info.plist</string>
                <key>plist_data</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>%izpack_app_ver%</string>
                    <key>CFBundleIdentifier</key>
                    <string>org.squirrelsql.client</string>
                    <key>NSHumanReadableCopyright</key>
                    <string>Copyright (c) 2001-2020 Colin Bell, Gerd Wagner, Rob Manning and others</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%app_root%</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                    <key>CFBundleIdentifier</key>
                    <string>PKG_ID</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>%PKG_ID%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Applications/SquirreL SQL.app/Contents/MacOS/squirrel-sql.sh</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                            <key>mode</key>
                            <string>755</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
