<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of SQuirreL SQL Client.</string>
    <key>Identifier</key>
    <string>com.github.bnpl.autopkg.download.squirrelsql</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SQuirreLSQL</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.jessepeterson.munki.GrandPerspective/SourceForgeURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>SOURCEFORGE_PROJECT_ID</key>
                <string>28383</string>
                <key>SOURCEFORGE_FILE_PATTERN</key>
                <string>\.jar</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.jar</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
