<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of SQuirreL SQL Client.</string>
    <key>Identifier</key>
    <string>com.github.bnpl.autopkg.download.squirrelsql</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SQuirreLSQL</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://squirrel-sql.sourceforge.net/#installation</string>
                <key>re_pattern</key>
                <string>href=\"(https://sourceforge\.net/projects/squirrel-sql/files/1-stable/(\d(\.\d)+)/squirrel-sql-(\d(\.\d)+)-MACOSX-install\.jar/download)\"</string>
                <key>result_output_var_name</key>
                <string>prematch</string>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/18.1 Safari/605.1.15</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%prematch%</string>
                <key>re_pattern</key>
                <string>http-equiv="refresh" content=".*; url=(.*)"</string>
                <key>result_output_var_name</key>
                <string>match</string>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/18.1 Safari/605.1.15</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%prematch%</string>
                <key>re_pattern</key>
                <string>http-equiv="refresh" content=".*; url=.*/(.*\.jar).*"</string>
                <key>result_output_var_name</key>
                <string>namematch</string>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/18.1 Safari/605.1.15</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>filename</key>
                <string>%namematch%</string>
                <key>CHECK_FILESIZE_ONLY</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
